# 1. Empirisches Projekt
---
### **Skript zu Daten Manipulation, Visulallisierung und zur Regressions Analyse**

Dieses Sktipt soll euch helfen eine Datenanalyse sowie eine `Logistische Regression` aufzubauen.

*-> Falls ihr fragen habt bitte sagt mir bescheid ich helfe gerne aus!*

> E-Mail: riccardo.dandrea@live.de
> Ihr könnte gerne eine Mail schreiben wo wir uns Per zoom treffen können, falls ihr schwierigkeiten habt bei der Programmierung:
> BITTE schreibt in der MAIL:
> - Was habt ihr vor ?
> - Wo liegt das Problem mit Code und Fehlermeldung
> - und wann ihr euch Per zoom treffen wollt Tag und Uhrzeit.

Diese Information geben mir Zeit mich vorzubereiten auf das Problem

Für die Datenanalyse kann als unterstützung der Leitfaden "Leitfaden.ipynbn" als unterstützung genutzt werden.
Ab Punkt 2. wird erklärt wie Libaries installiert werden und wie die Daten eingelesen werden können. Sowie weitere Schritte zur Datenanalyse.


**Bedenke das du deine Daten immer hinterfragen solltest!!**

In [44]:
import pandas as pd

In [30]:
# Hier wird der Download für den Datensatz vorbereitet
file_id = '1uujka4TJygnHSrai5rDmao8z9SeP_PsE'
download_link = f"https://drive.google.com/uc?id={file_id}"

In [49]:
# Einen Datensatz mit Pandas laden
df = pd.read_csv(download_link, sep = ",")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [51]:
df.shape

(891, 12)

Um die Übersichtlichkeit beizubehalten kann man Spalten entfern mit folgender Funktion:

In [ ]:
df.drop(columns=["Spalte"], inplace=True) #<- Füge hier deine Spalte ein die du entferenen willst

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Anpassung der Datentypen
Bevor Daten richtig Manipuliert werden ist es von wichtigkeit die Datentypen anzupassen
Welche Datentypen es gibt kannst du im Leitfaden nachlesen unter Punkt 1.3.

Dabei haben wir folgenden eingabe möglichkeiten:

-> `"string"`

-> `"int"`

-> `"float"`

-> `"bool"`

-> `"category"`


**Entscheide nun im folgenden welcher Datentyp am besten wäre für  deine Daten:**

In [61]:
df["Survived"].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [66]:
df['Survived'] = df['Survived'].astype("category")
# df['Age'] = df['Age'].astype("string")
# df['Name'] = df['Name'].astype("string")
# df['Sex'] = df['Sex'].astype("string")
# df['Ticket'] = df['Ticket'].astype("string")
# df['Cabin'] = df['Cabin'].astype("string")
# df['Embarked'] = df['Embarked'].astype("category")

print(df.info())
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    category
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: category(1), float64(2), int64(4), object(5)
memory usage: 77.7+ KB
None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [63]:
df.describe().round(2)

       PassengerId  Pclass     Age   SibSp   Parch    Fare
count       891.00  891.00  714.00  891.00  891.00  891.00
mean        446.00    2.31   29.70    0.52    0.38   32.20
std         257.35    0.84   14.53    1.10    0.81   49.69
min           1.00    1.00    0.42    0.00    0.00    0.00
25%         223.50    2.00   20.12    0.00    0.00    7.91
50%         446.00    3.00   28.00    0.00    0.00   14.45
75%         668.50    3.00   38.00    1.00    0.00   31.00
max         891.00    3.00   80.00    8.00    6.00  512.33

## Fehleden Werte:
Der Umgang mit fehlende Werte

In [53]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## Datenfilterung
---

In [ ]:
df_filtered_educ = df[(df["wage"] > 12.00) & 
                      (df["educ"] == 12) & 
                      (df["metro"] == 0) &
                      (df["exper"] > 1) ] # Beachte das du nun deine gewünschte Spalten namen hinzufügen musst
df_filtered_educ

## Vis
---

In [6]:
import seaborn as sns

## Logistische Regression
---

In [ ]:
sns.scatterplot